/*

         *
        ***
       *****
      *******
     *********
    ***********
   *************
  ***************
 *****************
*******************

縦10行、横19文字

*/

#include <stdio.h>

int main(void)
{
    int i, j, k;

    // 縦の行
    for (i = 1; i <= 10; i++)
    {
        // 空白文字
        for (j = 10 - i; j > 0; j--)
        {
            putchar(' ');
        }
        // 「*」出力
        for (k = 1; k <= 2 * i - 1; k++)
        {
            putchar('*');
        }

        putchar('\n');
    }

    return 0;
}
